app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'staff_lisa'
 LIMIT 1
---
    public function attemptLogin()
    {
        if (!$this->validate([
            'username' => 'required',
            'password' => 'required'
        ])) {
            return redirect()->back()->withInput()->with('error', 'Username dan Password wajib diisi.');
        }

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $user = $this->userModel->where('username', $username)->first();

INSERT INTO `log_aktivitas` (`users_id`, `action`, `detail`) VALUES ('5', 'LOGIN', 'User Nurhalisa Staff berhasil login.')
---
                ]);

                $db = \Config\Database::connect();
                $db->table('log_aktivitas')->insert([
                    'users_id'   => $user['id'],
                    'action'     => 'LOGIN',
                    'detail'     => 'User ' . $user['nama'] . ' berhasil login.',
                ]);