app/Controllers/Item.php

    public function index()
    {
        $keyword = $this->request->getVar('keyword');
        $itemData = $this->itemModel->getItemWithSupplier();

        if ($keyword) {
            $itemData->like('item.nama', $keyword);
        }

        $data = [
            'items'   => $itemData->paginate(10, 'item'),
            'pager'   => $this->itemModel->pager,
            'keyword' => $keyword
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `item`
JOIN `supplier` ON `supplier`.`id` = `item`.`supplier_id`
SELECT `item`.*, `supplier`.`nama` as `nama_supplier`
FROM `item`
JOIN `supplier` ON `supplier`.`id` = `item`.`supplier_id`
 LIMIT 10

    public function create()
    {
        $data = [
            'suppliers' => $this->supplierModel->findAll()
        ];
---
SELECT *
FROM `supplier`

    public function edit($id)
    {
        $data = [
            'item'      => $this->itemModel->find($id),
            'suppliers' => $this->supplierModel->findAll()
        ];
---
SELECT *
FROM `item`
WHERE `item`.`id` = '1'
SELECT *
FROM `supplier`