app/Controllers/Order.php

    public function create()
    {
    $customerModel = new \App\Models\CustomerModel();

    $data = [
        'items'     => $this->itemModel->findAll(),
        // Mengambil semua data dari tabel customer Anda
        'customers' => $customerModel->findAll()
    ];
---
SELECT *
FROM `customer`
SELECT *
FROM `item`

    public function store()
    {
        $items_post = $this->request->getPost('items');
        $total_bayar = 0;

        foreach ($items_post as $item) {
            $total_bayar += $item['subtotal'];
        }

        $this->orderModel->insert([
            'users_id'      => 1,
            'customer_id'   => $this->request->getPost('customer_id'),
            'tanggal_order' => date('Y-m-d H:i:s'),
            'jumlah_total'  => $total_bayar,
            'status'        => 'PAID'
        ]);

        $order_id = $this->orderModel->insertID();

        foreach ($items_post as $item) {
            $this->orderItemModel->insert([
                'orders_id'  => $order_id,
                'item_id'    => $item['item_id'],
                'kuantitas'  => $item['qty'],
                'harga_unit' => $item['harga'],
                'subtotal'   => $item['subtotal']
            ]);

            // Update Stok
            $barang = $this->itemModel->find($item['item_id']);
            $this->itemModel->update($item['item_id'], [
                'stok' => $barang['stok'] - $item['qty']
            ]);
---
INSERT INTO `orders` (`users_id`, `customer_id`, `tanggal_order`, `jumlah_total`, `status`) VALUES (1, '1', '2026-01-06 13:13:32', 6000, 'PAID')
INSERT INTO `order_item` (`orders_id`, `item_id`, `kuantitas`, `harga_unit`, `subtotal`) VALUES (1, '1', '6', '1000.00', '6000')
SELECT *
FROM `item`
WHERE `item`.`id` = '1'
UPDATE `item` SET `stok` = 394, `updated_at` = '2026-01-06 13:13:32'
WHERE `item`.`id` IN ('1')

    public function preview($id)
    {
        $data['order'] = $this->orderModel->find($id);
        $data['details'] = $this->orderItemModel
            ->select('order_item.*, item.nama as nama_barang')
            ->join('item', 'item.id = order_item.item_id')
            ->where('orders_id', $id)
            ->findAll();
---
SELECT *
FROM `orders`
WHERE `orders`.`id` = '1'
SELECT `order_item`.*, `item`.`nama` as `nama_barang`
FROM `order_item`
JOIN `item` ON `item`.`id` = `order_item`.`item_id`
WHERE `orders_id` = '1'